//   и USER_PASSWORD

// e2e (end-to-end) автотест для покемонов: на покупку нового аватара для своего тренера
// При end-2-end тестировании мы проходим критический путь за пользователя. Например, это может быть покупка товара для вайлберис, заказ такси для яндекс.такси, а для покемонов — весь путь по покупке аватара или проведение одной битвы
// Важно: если автотест выдаёт ошибку на покемонах при вводе логина и пароля, то нужно полностью отключить антивирус или сменить браузер на Electron
// В этом автотесте есть сложный момент — как каждый раз выбирать разный аватар.
// Нужно искать карточку с аватаром, у которой есть класс available

describe('Покупка аватара', function () {                  // название коллекции, в сайпресс называется Спека

    it('e2e тест на покупку нового аватара для тренера', function () {   //it = начинается автотест
         cy.visit('https://pokemonbattle.ru/');                                                 // зайти на сайт

         cy.get('input[type="email"]').type('USER_LOGIN');         //ввести  логин
         cy.get('input[type="password"]').type('USER_PASSWORD');  // ввеcти пароль
         cy.get('button[type="submit"]').click();                // нажать кнопку войти

         cy.wait(2000);

         cy.get('.header__container > .header__id').click({ force: true }); // клик по кнопке тренера
         cy.get('[href="/shop"] > .history-info').click();                 // нажать кнопку смена аватара
         cy.get('.available > button').first().click({ force: true });    // клик Купить первый доступный аватар
         cy.get('.credit').type('4620869113632996');                     // ввести номер карты
         cy.get('.k_input_date').type('1225');                          // ввести срок действия карты
         cy.get('.k_input_ccv').type('125');                           // ввести CVV карты
         cy.get('.k_input_name').type('Maria Petrova');               // ввести имя владельца действия карты
         cy.get('.pay-btn').click();                                 // нажать кнопку Оплатить
         cy.get('#cardnumber').type('56456');                         // ввести код подтверждения СМС
         cy.get('.payment__submit-button').click();                   // нажать кнопку Отправить
         cy.contains('Покупка прошла успешно').should('be.visible');  // проверяем наличие и видимость сообщения о успешной покупке        
        
        })
})

